lkolbly/cmsis-svd/data/Atmel/ATSAMDA0J14A.svd
       </cluster> <!-- TcCount32 -->
      </registers>
    </peripheral>
    <peripheral derivedFrom="TC3">
      <name>TC4</name>
      <description>Basic Timer Counter 4</description>
      <baseAddress>0x42003000</baseAddress>
      <interrupt>
        <name>TC4</name>
        <value>19</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TC3">
      <name>TC5</name>
      <description>Basic Timer Counter 5</description>
      <baseAddress>0x42003400</baseAddress>
      <interrupt>
        <name>TC5</name>
        <value>20</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TC3">
      <name>TC6</name>
      <description>Basic Timer Counter 6</description>
      <baseAddress>0x42003800</baseAddress>
      <interrupt>
        <name>TC6</name>
        <value>21</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TC3">
      <name>TC7</name>
      <description>Basic Timer Counter 7</description>
      <baseAddress>0x42003C00</baseAddress>
      <interrupt>
        <name>TC7</name>
        <value>22</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>TCC0</name>
      <version>1.2.1</version>
      <description>Timer Counter Control 0</description>
      <groupName>TCC</groupName>
      <prependToName>TCC_</prependToName>
      <baseAddress>0x42002000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x090</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TCC0</name>
        <value>15</value>
      </interrupt>
      <registers>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CC%s</name>
          <description>Compare and Capture</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CC</name>
              <description>Channel Compare/Capture Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CC%s_DITH4</name>
          <description>Compare and Capture</description>
          <alternateRegister>CC%s</alternateRegister>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DITHERCY</name>
              <description>Dithering Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CC</name>
              <description>Channel Compare/Capture Value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CC%s_DITH5</name>
          <description>Compare and Capture</description>
          <alternateRegister>CC%s</alternateRegister>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DITHERCY</name>
              <description>Dithering Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>CC</name>
              <description>Channel Compare/Capture Value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CC%s_DITH6</name>
          <description>Compare and Capture</description>
          <alternateRegister>CC%s</alternateRegister>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DITHERCY</name>
              <description>Dithering Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CC</name>
              <description>Channel Compare/Capture Value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CCB%s</name>
          <description>Compare and Capture Buffer</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CCB</name>
              <description>Channel Compare/Capture Buffer Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CCB%s_DITH4</name>
          <description>Compare and Capture Buffer</description>
          <alternateRegister>CCB%s</alternateRegister>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DITHERCYB</name>
              <description>Dithering Buffer Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CCB</name>
              <description>Channel Compare/Capture Buffer Value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CCB%s_DITH5</name>
          <description>Compare and Capture Buffer</description>
          <alternateRegister>CCB%s</alternateRegister>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DITHERCYB</name>
              <description>Dithering Buffer Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>CCB</name>
              <description>Channel Compare/Capture Buffer Value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CCB%s_DITH6</name>
          <description>Compare and Capture Buffer</description>
          <alternateRegister>CCB%s</alternateRegister>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DITHERCYB</name>
              <description>Dithering Buffer Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CCB</name>
              <description>Channel Compare/Capture Buffer Value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>COUNT</name>
          <description>Count</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>COUNT_DITH4</name>
          <description>Count</description>
          <alternateRegister>COUNT</alternateRegister>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>Counter Value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>COUNT_DITH5</name>
          <description>Count</description>
          <alternateRegister>COUNT</alternateRegister>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>Counter Value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>COUNT_DITH6</name>
          <description>Count</description>
          <alternateRegister>COUNT</alternateRegister>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>Counter Value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESOLUTION</name>
              <description>Enhanced Resolution</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>RESOLUTIONSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Dithering is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITH4</name>
                  <description>Dithering is done every 16 PWM frames</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITH5</name>
                  <description>Dithering is done every 32 PWM frames</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITH6</name>
                  <description>Dithering is done every 64 PWM frames</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESCALER</name>
              <description>Prescaler</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>PRESCALERSelect</name>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>No division</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Divide by 4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Divide by 8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>Divide by 16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>Divide by 64</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <description>Divide by 256</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV1024</name>
                  <description>Divide by 1024</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRESCSYNC</name>
              <description>Prescaler and Counter Synchronization Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>PRESCSYNCSelect</name>
                <enumeratedValue>
                  <name>GCLK</name>
                  <description>Reload or reset counter on next GCLK</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESC</name>
                  <description>Reload or reset counter on next prescaler clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESYNC</name>
                  <description>Reload or reset counter on next GCLK and reset prescaler counter</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALOCK</name>
              <description>Auto Lock</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPTEN0</name>
              <description>Capture Channel 0 Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPTEN1</name>
              <description>Capture Channel 1 Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPTEN2</name>
              <description>Capture Channel 2 Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPTEN3</name>
              <description>Capture Channel 3 Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLBCLR</name>
          <description>Control B Clear</description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DIR</name>
              <description>Counter Direction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LUPD</name>
              <description>Lock Update</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONESHOT</name>
              <description>One-Shot</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDXCMD</name>
              <description>Ramp Index Command</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>IDXCMDSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Command disabled: Index toggles between cycles A and B</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set index: cycle B will be forced in the next cycle</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear index: cycle A will be forced in the next cycle</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOLD</name>
                  <description>Hold index: the next cycle will be the same as the current cycle</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMD</name>
              <description>TCC Command</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>CMDSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRIGGER</name>
                  <description>Clear start, restart or retrigger</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Force stop</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDATE</name>
                  <description>Force update of double buffered registers</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READSYNC</name>
                  <description>Force COUNT read synchronization</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLBSET</name>
          <description>Control B Set</description>
          <addressOffset>0x05</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DIR</name>
              <description>Counter Direction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LUPD</name>
              <description>Lock Update</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONESHOT</name>
              <description>One-Shot</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDXCMD</name>
              <description>Ramp Index Command</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>IDXCMDSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Command disabled: Index toggles between cycles A and B</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set index: cycle B will be forced in the next cycle</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear index: cycle A will be forced in the next cycle</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOLD</name>
                  <description>Hold index: the next cycle will be the same as the current cycle</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMD</name>
              <description>TCC Command</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>CMDSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRIGGER</name>
                  <description>Clear start, restart or retrigger</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Force stop</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDATE</name>
                  <description>Force update of double buffered registers</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READSYNC</name>
                  <description>Force COUNT read synchronization</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCTRL</name>
          <description>Debug Control</description>
          <addressOffset>0x1E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DBGRUN</name>
              <description>Debug Running Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FDDBD</name>
              <description>Fault Detection on Debug Break Detection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
