lkolbly/cmsis-svd/data/Atmel/ATSAMDA0J14A.svd
        <register>
          <name>DRVCTRL</name>
          <description>Driver Control</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NRE0</name>
              <description>Non-Recoverable State 0 Output Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRE1</name>
              <description>Non-Recoverable State 1 Output Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRE2</name>
              <description>Non-Recoverable State 2 Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRE3</name>
              <description>Non-Recoverable State 3 Output Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRE4</name>
              <description>Non-Recoverable State 4 Output Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRE5</name>
              <description>Non-Recoverable State 5 Output Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRE6</name>
              <description>Non-Recoverable State 6 Output Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRE7</name>
              <description>Non-Recoverable State 7 Output Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRV0</name>
              <description>Non-Recoverable State 0 Output Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRV1</name>
              <description>Non-Recoverable State 1 Output Value</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRV2</name>
              <description>Non-Recoverable State 2 Output Value</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRV3</name>
              <description>Non-Recoverable State 3 Output Value</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRV4</name>
              <description>Non-Recoverable State 4 Output Value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRV5</name>
              <description>Non-Recoverable State 5 Output Value</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRV6</name>
              <description>Non-Recoverable State 6 Output Value</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRV7</name>
              <description>Non-Recoverable State 7 Output Value</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INVEN0</name>
              <description>Output Waveform 0 Inversion</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INVEN1</name>
              <description>Output Waveform 1 Inversion</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INVEN2</name>
              <description>Output Waveform 2 Inversion</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INVEN3</name>
              <description>Output Waveform 3 Inversion</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INVEN4</name>
              <description>Output Waveform 4 Inversion</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INVEN5</name>
              <description>Output Waveform 5 Inversion</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INVEN6</name>
              <description>Output Waveform 6 Inversion</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INVEN7</name>
              <description>Output Waveform 7 Inversion</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FILTERVAL0</name>
              <description>Non-Recoverable Fault Input 0 Filter Value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FILTERVAL1</name>
              <description>Non-Recoverable Fault Input 1 Filter Value</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EVCTRL</name>
          <description>Event Control</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EVACT0</name>
              <description>Timer/counter Input Event0 Action</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>EVACT0Select</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Event action disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRIGGER</name>
                  <description>Start, restart or re-trigger counter on event</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNTEV</name>
                  <description>Count on event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START</name>
                  <description>Start counter on event</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC</name>
                  <description>Increment counter on event</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNT</name>
                  <description>Count on active state of asynchronous event</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAULT</name>
                  <description>Non-recoverable fault</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVACT1</name>
              <description>Timer/counter Input Event1 Action</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>EVACT1Select</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Event action disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRIGGER</name>
                  <description>Re-trigger counter on event</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIR</name>
                  <description>Direction control</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stop counter on event</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEC</name>
                  <description>Decrement counter on event</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PPW</name>
                  <description>Period capture value in CC0 register, pulse width capture value in CC1 register</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWP</name>
                  <description>Period capture value in CC1 register, pulse width capture value in CC0 register</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAULT</name>
                  <description>Non-recoverable fault</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNTSEL</name>
              <description>Timer/counter Output Event Mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CNTSELSelect</name>
                <enumeratedValue>
                  <name>START</name>
                  <description>An interrupt/event is generated when a new counter cycle starts</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>END</name>
                  <description>An interrupt/event is generated when a counter cycle ends</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BETWEEN</name>
                  <description>An interrupt/event is generated when a counter cycle ends, except for the first and last cycles</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOUNDARY</name>
                  <description>An interrupt/event is generated when a new counter cycle starts or a counter cycle ends</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVFEO</name>
              <description>Overflow/Underflow Output Event Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGEO</name>
              <description>Retrigger Output Event Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNTEO</name>
              <description>Timer/counter Output Event Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCINV0</name>
              <description>Inverted Event 0 Input Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCINV1</name>
              <description>Inverted Event 1 Input Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCEI0</name>
              <description>Timer/counter Event 0 Input Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCEI1</name>
              <description>Timer/counter Event 1 Input Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCEI0</name>
              <description>Match or Capture Channel 0 Event Input Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCEI1</name>
              <description>Match or Capture Channel 1 Event Input Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCEI2</name>
              <description>Match or Capture Channel 2 Event Input Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCEI3</name>
              <description>Match or Capture Channel 3 Event Input Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCEO0</name>
              <description>Match or Capture Channel 0 Event Output Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCEO1</name>
              <description>Match or Capture Channel 1 Event Output Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCEO2</name>
              <description>Match or Capture Channel 2 Event Output Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCEO3</name>
              <description>Match or Capture Channel 3 Event Output Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FCTRLA</name>
          <description>Recoverable Fault A Configuration</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SRC</name>
              <description>Fault A Source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SRCSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Fault input disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>MCEx (x=0,1) event input</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <description>Inverted MCEx (x=0,1) event input</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALTFAULT</name>
                  <description>Alternate fault (A or B) state at the end of the previous period</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEEP</name>
              <description>Fault A Keeper</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QUAL</name>
              <description>Fault A Qualification</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLANK</name>
              <description>Fault A Blanking Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>BLANKSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No blanking applied</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Blanking applied from rising edge of the output waveform</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Blanking applied from falling edge of the output waveform</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Blanking applied from each toggle of the output waveform</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESTART</name>
              <description>Fault A Restart</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HALT</name>
              <description>Fault A Halt Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>HALTSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Halt action disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW</name>
                  <description>Hardware halt action</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW</name>
                  <description>Software halt action</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NR</name>
                  <description>Non-recoverable fault</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSEL</name>
              <description>Fault A Capture Channel</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CHSELSelect</name>
                <enumeratedValue>
                  <name>CC0</name>
                  <description>Capture value stored in channel 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC1</name>
                  <description>Capture value stored in channel 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC2</name>
                  <description>Capture value stored in channel 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC3</name>
                  <description>Capture value stored in channel 3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTURE</name>
              <description>Fault A Capture Action</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>CAPTURESelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No capture</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPT</name>
                  <description>Capture on fault</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTMIN</name>
                  <description>Minimum capture</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTMAX</name>
                  <description>Maximum capture</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCMIN</name>
                  <description>Minimum local detection</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCMAX</name>
                  <description>Maximum local detection</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DERIV0</name>
                  <description>Minimum and maximum local detection</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLANKVAL</name>
              <description>Fault A Blanking Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FILTERVAL</name>
              <description>Fault A Filter Value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
